# PhyMaterialParamStructuralDensity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamStructuralDensity Property
ParameterTypeId Class See Also
---
"Density"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamStructuralDensity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamStructuralDensity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamStructuralDensity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace